{
    "data_importer_automatic_importation": "Boolean value to determine if the data importation should be executed automatically or not.",
    "data_importer_creds_path": "Path to the credentials file for database access.",
    "data_importer_path_instants_data_saved": "Path where instants data from the database are saved.",
    "data_importer_database": "Name of the database from which to import data.",
    "data_importer_query": "SQL query to execute for data importation.",
    "data_importer_save_importation": "Boolean value to determine if the imported data should be saved to a file.",
    "data_importer_file_name": "Name of the file where the imported data should be saved.",
    "prepare_dataframe_from_db_cols_for_query" : "List of columns to be queried from the database.",
    "df_resampled_interpolated_resample_freq": "Frequency for resampling the time series data.",
    "df_resampled_interpolated_aggregation_func": "Aggregation function to use when resampling.",
    "df_resampled_interpolated_method":"Method to use for interpolating missing values.",
    "df_resampled_interpolated_outlier_cols": "Columns in which to detect and handle outliers.",
    "ini_train": "Start time for the training data period.",
    "fin_train": "End time for the training data period.",
    "fin_test": "End time for the testing data period.",
    "name_time_column": "Name of the time column in the data.",
    "name_id_sensor_column": "Name of the sensor ID column in the data.",
    "id_device": "ID of the device from which data is collected.",
    "names_objective_variable": "Name of the objective variable to predict.",
    "predictor": "Name of the machine learning model to use for prediction.",
    "X_name_features": "List of feature names for the predictor; if null, all columns except specified are used.",
    "Y_name_features": "Name of the target feature for prediction.",
    "n_lags": "Number of lag values to include as features.",
    "n_predictions": "Number of future time steps to predict.",
    "lag_columns": "List of columns for which lag values should be created; if null, specified columns are used.",
    "lead_columns": "Name of the column for lead values (i.e., future values to predict).",
    "num_obs_to_predict": "Number of observations to predict; if null, all observations are predicted.",
    "scale_in_preprocessing": "Boolean value to determine if scaling should be applied during preprocessing.",
    "path_to_save_model": "Path where the trained machine learning model should be saved.",
    "save_preprocessing": "Boolean value to determine if preprocessing steps should be saved.",
    "folder_name_model": "Name of the folder where the machine learning model should be saved.",
    "folder_name_preprocessed_data": "Name of the folder where preprocessed data should be saved.",
    "folder_name_time_execution": "Name of the folder to save execution time information; if null, a timestamped folder is created.",
    "machine_learning_model_args": "Dictionary of additional arguments to pass to the machine learning model."
}